In [1]:
import pandas as pd

# convert a list to a pandas series

In [2]:
li = [2,4,6,8]

In [3]:
pd.Series(li)

0    2
1    4
2    6
3    8
dtype: int64

# pandas Series with the index

In [4]:
li = [1,2,3,4,5,6,7,5]
ind = ['a','b','k','d','e','r','r','b']
pd.Series(li,index=ind)

a    1
b    2
k    3
d    4
e    5
r    6
r    7
b    5
dtype: int64

# the first element is values and index will be the list.

In [5]:
s = pd.Series(ind, index=li)

In [6]:
s

1    a
2    b
3    k
4    d
5    e
6    r
7    r
5    b
dtype: object

# slicing the pandas series

In [7]:
s[1:]

2    b
3    k
4    d
5    e
6    r
7    r
5    b
dtype: object

In [8]:
s

1    a
2    b
3    k
4    d
5    e
6    r
7    r
5    b
dtype: object

In [9]:
ser = pd.Series(li,index=ind)
ser

a    1
b    2
k    3
d    4
e    5
r    6
r    7
b    5
dtype: int64

# indexing through the key value

In [10]:
ser['a']

1

# indexing through a number

In [11]:
ser[0]

1

In [12]:
ser['b']

b    2
b    5
dtype: int64

# getting the head of the series

In [13]:
ser = pd.Series([1,2,3,4,5,4,6,7,8,9,0])

In [14]:
ser.head() # returns the first 5 elements

0    1
1    2
2    3
3    4
4    5
dtype: int64

# creating the series using the numpy arrays

In [15]:
import numpy as np 
arr = np.arange(0,12,1)
ser = pd.Series(arr)
ser.head()

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [16]:
ser.tail()

7      7
8      8
9      9
10    10
11    11
dtype: int32

In [17]:
ser.head()

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [18]:
ser.tail(3)

9      9
10    10
11    11
dtype: int32

# location in series

In [19]:
ser.loc[3]

3

# integer location in series

In [20]:
ser.iloc[3]

3

In [21]:
ser.loc[3:7]

3    3
4    4
5    5
6    6
7    7
dtype: int32

# type of the series

In [22]:
type(ser)

pandas.core.series.Series

# fequency in a series

In [23]:
ser4 = pd.Series(['India','US','India','China','India'])
ser4

0    India
1       US
2    India
3    China
4    India
dtype: object

In [24]:
ser4.value_counts()

India    3
China    1
US       1
dtype: int64

# finding the unique values in the series

In [25]:
ser4.unique()

array(['India', 'US', 'China'], dtype=object)

# finding number of unique elements in the series

In [26]:
ser4.nunique() # there are three unique numbers present in the series

3

# max and min in series

In [27]:
ser4.min()

'China'

In [28]:
ser4.max()

'US'

# index of max or min in the series

In [29]:
ser

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
dtype: int32

In [30]:
ser.idxmax() # index for the minimum value

11

In [31]:
ser.idxmin() # index for the maximum value

0

# argmax and arg min are not allowed for object data type

In [32]:
ser4.argmax()

TypeError: reduction operation 'argmax' not allowed for this dtype

In [66]:
ser4.argmin()

TypeError: reduction operation 'argmin' not allowed for this dtype

In [67]:
ser = pd.Series(np.arange(0,4),index=['a','b','c','d'])

In [68]:
ser['c']

2

In [69]:
ser.loc['c']

2

In [70]:
# iloc only works on the integer index

In [71]:
ser.iloc['c']

TypeError: Cannot index by location index with a non-integer key

# convert the elements of the series to a list

In [72]:
ser4.tolist()

['India', 'US', 'India', 'China', 'India']

# dictonary to pandas series

In [73]:
data = {'A1':'India','A2':'China','A3':'US','A4':'Chile'}

In [74]:
pd.DataFrame(data.items())

    0      1
0  A1  India
1  A2  China
2  A3     US
3  A4  Chile

# numpy arrays to dataframe

In [75]:
df = pd.DataFrame(np.arange(0,50,3)) # numpy array to a dataframe

In [76]:
type(df)

pandas.core.frame.DataFrame

# converting from a list to a dataframe

In [77]:
df1 = pd.DataFrame(['India','US','India','China','India'])

In [78]:
df1

       0
0  India
1     US
2  India
3  China
4  India

In [79]:
df1['new'] = np.arange(0,5)

In [80]:
df1[['new1','new2']] = 12,12

# reading dataframe in jupyter notebook

In [81]:
df = pd.read_csv(r'dm.csv')

In [82]:
type(df)

pandas.core.frame.DataFrame

In [83]:
df.head()

,Age,Gender,OwnHome,Married,Location,Salary,Children,History,Catalogs,AmountSpent,Cust_Id
0,Old,Female,Own,Single,Far,47500,0,High,6,755,247
1,Middle,Male,Rent,Single,Close,63600,0,High,6,1318,127
2,Young,Female,Rent,Single,Close,13500,0,Low,18,296,479
3,Middle,Male,Own,Married,Close,85600,1,High,18,2436,475
4,Middle,Female,Own,Single,Close,68400,0,High,12,1304,151

In [84]:
df.tail()

,Age,Gender,OwnHome,Married,Location,Salary,Children,History,Catalogs,AmountSpent,Cust_Id
995,Young,Female,Rent,Single,Close,19400,1,NaN,18,384,190
996,Middle,Male,Rent,Single,Far,40500,1,NaN,18,1073,510
997,Old,Male,Own,Single,Close,44800,0,Medium,24,1417,725
998,Middle,Male,Own,Married,Close,79000,2,Medium,18,671,1034
999,Young,Male,Rent,Married,Close,53600,1,Medium,24,973,1203

# getting the columns of the dataframe

In [85]:
df.columns

Index(['Age', 'Gender', 'OwnHome', 'Married', 'Location', 'Salary', 'Children',
       'History', 'Catalogs', 'AmountSpent', 'Cust_Id'],
      dtype='object')

In [86]:
df.index

RangeIndex(start=0, stop=1000, step=1)

In [87]:
df

,Age,Gender,OwnHome,Married,Location,Salary,Children,History,Catalogs,AmountSpent,Cust_Id
0,Old,Female,Own,Single,Far,47500,0,High,6,755,247
1,Middle,Male,Rent,Single,Close,63600,0,High,6,1318,127
2,Young,Female,Rent,Single,Close,13500,0,Low,18,296,479
3,Middle,Male,Own,Married,Close,85600,1,High,18,2436,475
4,Middle,Female,Own,Single,Close,68400,0,High,12,1304,151
...,...,...,...,...,...,...,...,...,...,...,...
995,Young,Female,Rent,Single,Close,19400,1,NaN,18,384,190
996,Middle,Male,Rent,Single,Far,40500,1,NaN,18,1073,510
997,Old,Male,Own,Single,Close,44800,0,Medium,24,1417,725
998,Middle,Male,Own,Married,Close,79000,2,Medium,18,671,1034
999,Young,Male,Rent,Married,Close,53600,1,Medium,24,973,1203

In [88]:
df.shape

(1000, 11)

# Select only one row from the data frame

In [91]:
df['Age'] # each and every column of a dataframa is a series

0         Old
1      Middle
2       Young
3      Middle
4      Middle
        ...
995     Young
996    Middle
997       Old
998    Middle
999     Young
Name: Age, Length: 1000, dtype: object

In [92]:
type(df['Age'])

pandas.core.series.Series

In [93]:
isinstance(df['Age'],pd.Series)

True

# get two columns

In [101]:
df[['Gender','Salary']] # to get multiple columns we pass the column names as lists

# multiple columns returns dataframes

     Gender  Salary
0    Female   47500
1      Male   63600
2    Female   13500
3      Male   85600
4    Female   68400
..      ...     ...
995  Female   19400
996    Male   40500
997    Male   44800
998    Male   79000
999    Male   53600

[1000 rows x 2 columns]

In [102]:
type(df[['Gender','Salary']])

pandas.core.frame.DataFrame

In [103]:
isinstance(df[['Gender','Salary']],pd.DataFrame)

True

In [104]:
pd.DataFrame

pandas.core.frame.DataFrame

# get data columns and data types

In [107]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Age          1000 non-null   object
 1   Gender       1000 non-null   object
 2   OwnHome      1000 non-null   object
 3   Married      1000 non-null   object
 4   Location     1000 non-null   object
 5   Salary       1000 non-null   int64
 6   Children     1000 non-null   int64
 7   History      697 non-null    object
 8   Catalogs     1000 non-null   int64
 9   AmountSpent  1000 non-null   int64
 10  Cust_Id      1000 non-null   int64
dtypes: int64(5), object(6)
memory usage: 86.1+ KB

# describing the dataset

In [109]:
df.describe() # only get the output for categorical columns

              Salary    Children     Catalogs  AmountSpent      Cust_Id
count    1000.000000  1000.00000  1000.000000  1000.000000  1000.000000
mean    56103.900000     0.93400    14.682000  1216.770000   643.930000
std     30616.314826     1.05107     6.622895   961.068613   369.047166
min     10100.000000     0.00000     6.000000    38.000000    12.000000
25%     29975.000000     0.00000     6.000000   488.250000   316.750000
50%     53700.000000     1.00000    12.000000   962.000000   636.000000
75%     77025.000000     2.00000    18.000000  1688.500000   955.500000
max    168800.000000     3.00000    24.000000  6217.000000  1297.000000

# to include all numeric and categorical data

In [111]:
df.describe(include='all')

,Age,Gender,OwnHome,Married,Location,Salary,Children,History,Catalogs,AmountSpent,Cust_Id
count,1000,1000,1000,1000,1000,1000.000000,1000.00000,697,1000.000000,1000.000000,1000.000000
unique,3,2,2,2,2,NaN,NaN,3,NaN,NaN,NaN
top,Middle,Female,Own,Married,Close,NaN,NaN,High,NaN,NaN,NaN
freq,508,506,516,502,710,NaN,NaN,255,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,56103.900000,0.93400,NaN,14.682000,1216.770000,643.930000
std,NaN,NaN,NaN,NaN,NaN,30616.314826,1.05107,NaN,6.622895,961.068613,369.047166
min,NaN,NaN,NaN,NaN,NaN,10100.000000,0.00000,NaN,6.000000,38.000000,12.000000
25%,NaN,NaN,NaN,NaN,NaN,29975.000000,0.00000,NaN,6.000000,488.250000,316.750000
50%,NaN,NaN,NaN,NaN,NaN,53700.000000,1.00000,NaN,12.000000,962.000000,636.000000
75%,NaN,NaN,NaN,NaN,NaN,77025.000000,2.00000,NaN,18.000000,1688.500000,955.500000
max,NaN,NaN,NaN,NaN,NaN,168800.000000,3.00000,NaN,24.000000,6217.000000,1297.000000

# describe the object datatype

In [113]:
# only describe the object datatype 
df.describe(include='O')
# this also describes the frequency of the top categorical element.

           Age  Gender OwnHome  Married Location History
count     1000    1000    1000     1000     1000     697
unique       3       2       2        2        2       3
top     Middle  Female     Own  Married    Close    High
freq       508     506     516      502      710     255

# frequency distribution for categorical columns

In [119]:
df['Age'].value_counts()

Middle    508
Young     287
Old       205
Name: Age, dtype: int64

In [121]:
df.Location.value_counts() / (710 + 290)

Close    0.71
Far      0.29
Name: Location, dtype: float64

# unique values in the data

In [123]:
df['Age'].unique()

array(['Old', 'Middle', 'Young'], dtype=object)

In [124]:
df['Age'].nunique()

3

# find the mean of the columns

In [125]:
df['Salary'].mean()

56103.9

In [126]:
df['Salary'].median()

53700.0

# dimensions of the data

In [128]:
df.ndim

2

# indexing operations of the dataframe

In [132]:
df[df['Salary'] > 56000]

,Age,Gender,OwnHome,Married,Location,Salary,Children,History,Catalogs,AmountSpent,Cust_Id
1,Middle,Male,Rent,Single,Close,63600,0,High,6,1318,127
3,Middle,Male,Own,Married,Close,85600,1,High,18,2436,475
4,Middle,Female,Own,Single,Close,68400,0,High,12,1304,151
7,Middle,Male,Own,Single,Close,68400,0,High,18,1155,790
9,Old,Male,Own,Married,Far,80700,0,NaN,18,3034,475
...,...,...,...,...,...,...,...,...,...,...,...
989,Middle,Male,Own,Married,Far,102700,1,High,18,3785,1269
990,Middle,Male,Own,Married,Close,123800,2,NaN,18,3537,898
992,Middle,Male,Own,Married,Close,101700,1,NaN,6,941,1283
993,Middle,Female,Own,Married,Far,99200,0,High,24,5503,924
998,Middle,Male,Own,Married,Close,79000,2,Medium,18,671,1034

In [137]:
df[df['Salary'] > 56000]['Salary']

1       63600
3       85600
4       68400
7       68400
9       80700
        ...
989    102700
990    123800
992    101700
993     99200
998     79000
Name: Salary, Length: 465, dtype: int64

In [138]:
df[df['Salary'] > 56000][['Age','Gender']]

        Age  Gender
1    Middle    Male
3    Middle    Male
4    Middle  Female
7    Middle    Male
9       Old    Male
..      ...     ...
989  Middle    Male
990  Middle    Male
992  Middle    Male
993  Middle  Female
998  Middle    Male

[465 rows x 2 columns]

# rows where age is middle

SELECT COUNT(Age) WHERE Age = Middle;

In [140]:
(df['Age'] == 'Middle').sum()

508

In [142]:
df[df['Age'] == 'Middle']['Age'].count()

508

SELECT Age, Salary FROM table 
WHERE Age = Old AND Salary > 56000

In [144]:
# the customer is old and salary greater than 56000

In [143]:
df[(df['Age'] == "Old") & (df['Salary'] > 56000)]

,Age,Gender,OwnHome,Married,Location,Salary,Children,History,Catalogs,AmountSpent,Cust_Id
9,Old,Male,Own,Married,Far,80700,0,NaN,18,3034,475
14,Old,Female,Own,Married,Far,110000,0,High,24,5564,477
16,Old,Female,Own,Married,Close,82800,0,High,24,3010,160
22,Old,Female,Rent,Married,Far,60200,0,High,18,2328,1221
43,Old,Female,Rent,Married,Far,81500,0,High,18,3655,1010
...,...,...,...,...,...,...,...,...,...,...,...
960,Old,Male,Own,Single,Close,71300,0,High,18,1543,1024
966,Old,Male,Rent,Married,Close,71800,0,High,12,1389,1173
984,Old,Male,Rent,Married,Far,66200,0,High,24,2057,799
986,Old,Male,Own,Single,Close,63200,0,High,24,1507,331
987,Old,Male,Own,Married,Far,112900,0,High,24,6217,975

In [153]:
df[df['Married'] == 'Single']['Salary'].max()

82800

# mean salary of female and male customers

In [159]:
df[df['Gender'] == "Female"]['Salary'].mean()

48197.43083003953

In [161]:
df[df['Gender'] == "Female"]['Salary'].max()

135700

In [160]:
df[df['Gender'] == "Male"]['Salary'].mean()

64202.42914979757

In [162]:
df[df['Gender'] == "Male"]['Salary'].max()

168800

# What is the mean salary of customers with atleast one childresn

In [168]:


df[(df['Children'] >= 1) & (df['Married'] == 'Single')]['Salary'].mean()

33228.089887640446

SELECT AVG(SALARY) WHERE Children > 1 AND Married = 'Single';

# what percentage of rented customers are single

In [180]:
(df[(df['OwnHome'] == 'Rent') & (df['Married'] == 'Single')].shape[0]/df.shape[0]) * 100

30.7

In [190]:
df[(df['OwnHome'] == 'Rent') & (df['Married'] == 'Single')]['OwnHome'].value_counts(normalize=True)

Rent    1.0
Name: OwnHome, dtype: float64




# PANDAS DAY TWO

In [52]:
import pandas as pd 
import numpy as np
df = pd.read_csv(r'dm.csv')

In [53]:
df

,Age,Gender,OwnHome,Married,Location,Salary,Children,History,Catalogs,AmountSpent,Cust_Id
0,Old,Female,Own,Single,Far,47500,0,High,6,755,247
1,Middle,Male,Rent,Single,Close,63600,0,High,6,1318,127
2,Young,Female,Rent,Single,Close,13500,0,Low,18,296,479
3,Middle,Male,Own,Married,Close,85600,1,High,18,2436,475
4,Middle,Female,Own,Single,Close,68400,0,High,12,1304,151
...,...,...,...,...,...,...,...,...,...,...,...
995,Young,Female,Rent,Single,Close,19400,1,NaN,18,384,190
996,Middle,Male,Rent,Single,Far,40500,1,NaN,18,1073,510
997,Old,Male,Own,Single,Close,44800,0,Medium,24,1417,725
998,Middle,Male,Own,Married,Close,79000,2,Medium,18,671,1034
999,Young,Male,Rent,Married,Close,53600,1,Medium,24,973,1203

# using the log function to find the log of the salary

In [54]:
df['log_salary'] = np.log(df['Salary'])

In [55]:
df.log_salary

0      10.768485
1      11.060369
2       9.510445
3      11.357441
4      11.133128
         ...
995     9.873028
996    10.609057
997    10.709963
998    11.277203
999    10.889304
Name: log_salary, Length: 1000, dtype: float64

# dropping the columns

In [56]:
df.drop(columns='log_salary')

,Age,Gender,OwnHome,Married,Location,Salary,Children,History,Catalogs,AmountSpent,Cust_Id
0,Old,Female,Own,Single,Far,47500,0,High,6,755,247
1,Middle,Male,Rent,Single,Close,63600,0,High,6,1318,127
2,Young,Female,Rent,Single,Close,13500,0,Low,18,296,479
3,Middle,Male,Own,Married,Close,85600,1,High,18,2436,475
4,Middle,Female,Own,Single,Close,68400,0,High,12,1304,151
...,...,...,...,...,...,...,...,...,...,...,...
995,Young,Female,Rent,Single,Close,19400,1,NaN,18,384,190
996,Middle,Male,Rent,Single,Far,40500,1,NaN,18,1073,510
997,Old,Male,Own,Single,Close,44800,0,Medium,24,1417,725
998,Middle,Male,Own,Married,Close,79000,2,Medium,18,671,1034
999,Young,Male,Rent,Married,Close,53600,1,Medium,24,973,1203

# dropping columns inplace

In [57]:
df.drop('log_salary', axis=1, inplace=True)

In [58]:
df

,Age,Gender,OwnHome,Married,Location,Salary,Children,History,Catalogs,AmountSpent,Cust_Id
0,Old,Female,Own,Single,Far,47500,0,High,6,755,247
1,Middle,Male,Rent,Single,Close,63600,0,High,6,1318,127
2,Young,Female,Rent,Single,Close,13500,0,Low,18,296,479
3,Middle,Male,Own,Married,Close,85600,1,High,18,2436,475
4,Middle,Female,Own,Single,Close,68400,0,High,12,1304,151
...,...,...,...,...,...,...,...,...,...,...,...
995,Young,Female,Rent,Single,Close,19400,1,NaN,18,384,190
996,Middle,Male,Rent,Single,Far,40500,1,NaN,18,1073,510
997,Old,Male,Own,Single,Close,44800,0,Medium,24,1417,725
998,Middle,Male,Own,Married,Close,79000,2,Medium,18,671,1034
999,Young,Male,Rent,Married,Close,53600,1,Medium,24,973,1203

# axis = 1 represents the columns dropping the column Cust_Id

In [59]:

df.drop("Cust_Id", axis=1)

,Age,Gender,OwnHome,Married,Location,Salary,Children,History,Catalogs,AmountSpent
0,Old,Female,Own,Single,Far,47500,0,High,6,755
1,Middle,Male,Rent,Single,Close,63600,0,High,6,1318
2,Young,Female,Rent,Single,Close,13500,0,Low,18,296
3,Middle,Male,Own,Married,Close,85600,1,High,18,2436
4,Middle,Female,Own,Single,Close,68400,0,High,12,1304
...,...,...,...,...,...,...,...,...,...,...
995,Young,Female,Rent,Single,Close,19400,1,NaN,18,384
996,Middle,Male,Rent,Single,Far,40500,1,NaN,18,1073
997,Old,Male,Own,Single,Close,44800,0,Medium,24,1417
998,Middle,Male,Own,Married,Close,79000,2,Medium,18,671
999,Young,Male,Rent,Married,Close,53600,1,Medium,24,973

In [60]:
df = df.drop('Cust_Id',axis=1)
# df.drop("Cust_Id", axis = 1, inplace = True)

In [61]:
df

,Age,Gender,OwnHome,Married,Location,Salary,Children,History,Catalogs,AmountSpent
0,Old,Female,Own,Single,Far,47500,0,High,6,755
1,Middle,Male,Rent,Single,Close,63600,0,High,6,1318
2,Young,Female,Rent,Single,Close,13500,0,Low,18,296
3,Middle,Male,Own,Married,Close,85600,1,High,18,2436
4,Middle,Female,Own,Single,Close,68400,0,High,12,1304
...,...,...,...,...,...,...,...,...,...,...
995,Young,Female,Rent,Single,Close,19400,1,NaN,18,384
996,Middle,Male,Rent,Single,Far,40500,1,NaN,18,1073
997,Old,Male,Own,Single,Close,44800,0,Medium,24,1417
998,Middle,Male,Own,Married,Close,79000,2,Medium,18,671
999,Young,Male,Rent,Married,Close,53600,1,Medium,24,973

# getting the first row from column age

In [63]:
df.loc[1,"Age"]

'Middle'

# get first row from columns age and gender

In [64]:
df.loc[1,['Age','Gender']]

Age       Middle
Gender      Male
Name: 1, dtype: object

# get first rows and all the columns

In [65]:
df.loc[1,:]

Age            Middle
Gender           Male
OwnHome          Rent
Married        Single
Location        Close
Salary          63600
Children            0
History          High
Catalogs            6
AmountSpent      1318
Name: 1, dtype: object

# using the integers for referencing the columns throws and value error

In [66]:
df.loc[1,3]

KeyError: 3

# all the rows for the age column

In [68]:
df.loc[:,"Age"]

0         Old
1      Middle
2       Young
3      Middle
4      Middle
        ...
995     Young
996    Middle
997       Old
998    Middle
999     Young
Name: Age, Length: 1000, dtype: object

In [71]:
df.loc[:,['Married','Age']]

     Married     Age
0     Single     Old
1     Single  Middle
2     Single   Young
3    Married  Middle
4     Single  Middle
..       ...     ...
995   Single   Young
996   Single  Middle
997   Single     Old
998  Married  Middle
999  Married   Young

[1000 rows x 2 columns]

# getting particular rows from the dataframe for the column age

In [72]:
df.loc[[1,3,5,7],'Age']

1    Middle
3    Middle
5     Young
7    Middle
Name: Age, dtype: object

# getting the last row in the dataframe

In [73]:
df.loc[999,'Age']

'Young'

# getting the first row and first column from the dataframe

In [74]:
df.iloc[1,1]

'Male'

# getting first row and all the remaining columns

In [76]:
df.iloc[1,[2,4,5]]

OwnHome      Rent
Location    Close
Salary      63600
Name: 1, dtype: object

# getting the first row and columns 3 to 6

In [78]:
df.iloc[1,3:6]

Married     Single
Location     Close
Salary       63600
Name: 1, dtype: object

# rows starting from 2 to 5 and first column

In [79]:
df.iloc[2:5,1]

2    Female
3      Male
4    Female
Name: Gender, dtype: object

# Group By in pandas its like SQL groupby

In [90]:
df.groupby('Gender').mean()['Salary']

Gender
Female    48197.43083
Male      64202.42915
Name: Salary, dtype: float64

In [91]:
df.groupby('Gender')['Salary'].mean()

Gender
Female    48197.43083
Male      64202.42915
Name: Salary, dtype: float64

# getting the quantiles

In [93]:
df.quantile(0.25)

Salary         29975.00
Children           0.00
Catalogs           6.00
AmountSpent      488.25
Name: 0.25, dtype: float64

In [96]:
df.groupby('OwnHome').mean()

               Salary  Children   Catalogs  AmountSpent
OwnHome
Own      69758.720930  0.901163  15.279070  1543.135659
Rent     41546.280992  0.969008  14.045455   868.826446

In [98]:
df['Salary'].describe()

count      1000.000000
mean      56103.900000
std       30616.314826
min       10100.000000
25%       29975.000000
50%       53700.000000
75%       77025.000000
max      168800.000000
Name: Salary, dtype: float64

In [102]:
df[['Salary','AmountSpent']].describe()

              Salary  AmountSpent
count    1000.000000  1000.000000
mean    56103.900000  1216.770000
std     30616.314826   961.068613
min     10100.000000    38.000000
25%     29975.000000   488.250000
50%     53700.000000   962.000000
75%     77025.000000  1688.500000
max    168800.000000  6217.000000

# using groupby for two or more columns

In [108]:
df.groupby(['Gender','OwnHome']).mean()

                      Salary  Children   Catalogs  AmountSpent
Gender OwnHome
Female Own      60012.916667  0.945833  14.575000  1314.437500
       Rent     37536.842105  1.131579  13.691729   764.500000
Male   Own      78233.333333  0.862319  15.891304  1742.003623
       Rent     46438.532110  0.770642  14.477064   996.123853

In [107]:
df.groupby(['Gender','OwnHome']).mean()['AmountSpent']

Gender  OwnHome
Female  Own        1314.437500
        Rent        764.500000
Male    Own        1742.003623
        Rent        996.123853
Name: AmountSpent, dtype: float64